/*
    Нужно написать функцию, которая примет на вход массив чисел и вернет строку с количеством повторений

    - Счетчик для каждого числа в строке должен иметь такой вид: `${число}:${количество повторений}`
    - Если в входном массиве несколько чисел, то их нужно разделить запятой
    - Входной массив не отсортирован, числа могут идти в любом порядке
*/

const calcNumbersInArr = (arr) => {
    // code here
}

console.log(calcNumbersInArr([1, 2, 3, 4, 4]) === '1:1, 2:1, 3:1, 4:2')
console.log(calcNumbersInArr([1, 2, 4, 3, 1, 1, 4, 2]) === '1:3, 2:2, 3:1, 4:2') 